#include "serial.h"
#include <STC12C5A60S2.h>


/**********************************
*串口初始化
*
*振荡晶体为12MHz，PC串口端设置 [ 4800，8，无，1，无 ]
**********************************/
void serial_init(void){
	TMOD = 0x20;	//定时器1 工作方式2
	TH1 = 0xF3;	//定时器初值高8位设置
	TL1 = 0xF3;	//定时器初值低8位设置
	
	
	SCON = 0x50;	//串口工作方式1，允许串口接收
	PCON = 0x80;	//波特率倍频（屏蔽本句波特率为2400）
	
	ES = 1; //允许serial串口的中断
	EA = 1; //允许总中断
	TR1 = 1;	//定时器启动    
}


/************************************
*串口发送字符串
*
************************************/
void serial_tc(unsigned char *str){
	while(*str != '\0'){
		SBUF = *str;
		while(TI == 0);		//检查发送中断标志位
		TI = 0;			//令发送中断标志位为0（软件清零）
		str++;
	}
	str = 0;
}


/*****************************************
函数名：serial串口发送函数
调  用：serial_T (?);
参  数：需要serial串口发送的数据（8位/1字节）
返回值：无 
结  果：将参数中的数据发送给serial串口，确认发送完成后退出
备  注：
*******************************************/
void serial_t(unsigned char serial_data){ //定义串口发送数据变量
	SBUF = serial_data;	//将数据发送出去
	while(TI == 0);		//检查发送中断标志位
	TI = 0;			//令发送中断标志位为0（软件清零）
}



















